<template>
  <div class="view">
    <div class="ac">
      <div id="article" class="article">
        <h2>人和植物一样</h2>
        <p>对我来说，在地里种下一粒种子本身就是美好的。我总是带着喜悦和极大的敬畏去做这件事。</p>
        <p>种子种下去以后，我会看着我的花圃，想象生命是如何在眼睛看不见的黑暗地下工作的。</p>
        <p>
          我一直惦记着自己种下的种子。我常常在夜里醒来，陷入思索：雨水和露珠如何接触干燥的种壳，使它变得柔软。生命的精灵如何在种子里活跃起来，植物的个性如何呈现出来，种子如何挣脱囚禁自己的种壳，从中伸出两只手——一只手是根，负责抓住泥土，让自己挺立并吸收养料;另一只手伸出去寻找光，向上攀爬，痛饮微风和阳光，实现它完整的生命之美。
        </p>
        <h2>文明与野蛮</h2>
        <p>
          我们相信，人类社会会不断摒除野蛮，走向文明，因为绝大多数人向往文明，文明意味着尊重生命、维护人的尊严和自由、建立一种理性且科学的生活方式，让绝大多数人有安全感。人类历史正是因为人类对文明的追求与保护而顽强延续到今天，文明战胜野蛮，是必然的。
        </p>
        <h2>村庄的时间</h2>
        <div class="content">
          <p>
            当我十岁的时候站在我家后面的皂荚树下，我突然感到时间的停滞。我的视野里只有寂静的午后村庄，没有风，没有人，空气均匀地铺展在池塘的深绿色水面上。我在这种突如其来的空寂中不敢妄动，与此同时，心中涌起永恒的瞻望。我想我永远不会长大，鸭蹼状的宽大树叶也永遠不会扇动，而放眼望去，青砖平房、柴垛、洗衣石板都永远在这里，不会变动一分一毫。
          </p>
          <p>
            片刻后，一声狗吠从巷口穿透时间凝滞形成的雾状薄膜，小孩子在天台上望着奔跑而去的伙伴放声大哭，我从一种清亮的空寂时间一下子坠入纷杂的轰隆隆的时间洪流，一直到现在。
          </p>
          <p>
            我在城市的时间里看到时间是属于摇滚乐的，一年前还是土堆成山的地方，呼啦啦拔地而起一片楼群;又见拆迁的工地，昔日的楼房破腔露肚，灰白的墙壁上满是雨痕。重建与摧毁，搬入与流离，过去与现在宛如时间的两排利齿，一切都被咬得粉碎。
          </p>
        </div>
      </div>
    </div>
    <!-- container参数指定监听的容器 target触发滚动的对象 -->
    <div class="article-catalog">
      <u-anchor style="position: fixed" container="#article"></u-anchor>
    </div>
  </div>
</template>

<style lang="scss" scoped>
.view {
  display: flex;

  .article-catalog {
    flex: 1;
    margin-left: 10px;
    .u-anchor {
      position: relative;
      width: inherit;
    }
  }
}
.article {
  width: 500px;
  p {
    margin: 20px 0;
    font-size: 16px;
    line-height: 32px;
    word-break: break-all;
    text-indent: 2em;
  }
}
</style>
